{
    "title":"Tempter of the Bone（详解）",
    "tab":"标签：ACM BFS与DFS",
    "intron":"5",
    "intro":["The doggie found a bone in an ancient maze, which fascinated him a lot. However, when he picked it up, the maze began to shake, and the doggie could feel the ground sinking. He realized that the bone was a trap, and he tried desperately to get out of this maze.",
    "The maze was a rectangle with sizes N by M. There was a door in the maze. At the beginning, the door was closed and it would open at the T-th second for a short period of time (less than 1 second). Therefore the doggie had to arrive at the door on exactly the T-th second. In every second, he could move one block to one of the upper, lower, left and right neighboring blocks. Once he entered a block, the ground of this block would start to sink and disappear in the next second. He could not stay at one block for more than one second, nor could he move into a visited block. Can the poor doggie survive? Please help him. InputThe input consists of multiple test cases. The first line of each test case contains three integers N, M, and T (1 < N, M < 7; 0 < T < 50), which denote the sizes of the maze and the time at which the door will open, respectively. The next N lines give the maze layout, with each line containing M characters. A character is one of the following:",
    "'X': a block of wall, which the doggie cannot enter; 'S': the start point of the doggie; 'D': the Door; or'.': an empty block.",
    "The input is terminated with three 0's. This test case is not to be processed.",
    "Output For each test case, print in one line \"YES\" if the doggie can survive, or \"NO\" otherwise."],
    "inputn":"10",
    "input":["4 4 5","S.X.","..X.","..XD","....","3 4 5","S.X.","..X.","...D","0 0 0"],
    "outputn":"2",
    "output":["NO","YES"],
    "explann":"7",
    "coden":["1","4"],
    "explan":["N 行 M 列 T 时间，看这个doggie是否能在第T秒刚好到达门。S是doggie的起始位置，D是门的位置。一开始我对这个时间T有点不理解，拿题目中例2来说S走4步在D的前一个位置，再走一步到达D，题目是要在5秒刚好在D，而不是所谓的在时间T内到达就行了。",
    "这道题里涉及一些剪枝问题，如果不剪枝就会超时。（我们来把这道题的迷宫想象成一块一块的格子）。",
    "1、n*m-wall<=t",
    "n*m代表总共的格子，nm-wall代表能走的格子数目，t是时间，n*m-wall<=t也就是可以走的格子走完了时间T都没有到，肯定不能到达D。至于为什么有=，看的一个大佬写的一个例子：",
    "在这里n*m-wall=3*3-5=4=t，这里是不能到达的。",
    "2、奇偶剪枝",
    "因为两点之间直线最短，所以由S到达D的最短路径就是abs(sx-dx)+abs(sy-dy),可以把t理解为题目要你走的总步数，t-step就代表你任意走的总步数， 因为abs(sx-dx)+abs(sy-dy)已经是最短的步数了，你走的一定不可能比它更短，所以t-step肯定是要>=最短步数的。所以当t-step < abs(sx-dx)+abs(sy-dy)的时候， 我们就给它剪出去。（注意sx,sy,step都是在变化的）还有t-step-abs(sx-dx)-abs(sy-dy)必须是偶数，如果是奇数就不能到达D。"],
    "code":[["4","3 3 4","S X X",". X X","X . D"]],
    "answertxt":"3. 下面是代码",
    "answercode":"txt/acm1.txt",
    "declare":["转载说明：本文转自CSDN作者","https://blog.csdn.net/narzisen/article/details/80545804","聪明绝顶的你与即将秃头的我"],
    "urltpl":"tpl/acm.tpl"
}